from string import Template

#### RAG PROMPTS - Arabic ####


#### System ####

system_prompt_arabic = Template("\n".join([
    "أنت مساعد لتوليد استجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار المستخدم.",
    "عليك توليد استجابة بناءً على الوثائق المقدمة.",
    "تجاهل الوثائق التي لا تتعلق باستفسار المستخدم.",
    "إذا لم تكن متأكداً من الإجابة، قل 'لا أعرف'.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من الإجابة على السؤال.",
    "عليك توليد استجابة بنفس لغة استفسار المستخدم.",
    "كن مهذباً ومحترماً في استجابتك.",
    "كن دقيقاً ومختصراً في استجابتك. تجنب المعلومات غير الضرورية.",
]))


#### Document ####

document_prompt_arabic = Template(
    "\n".join([
        "## الوثيقة رقم: $doc_num",
        "### المحتوى: $chunk_text"
    ])
)

#### Footer ####

footer_prompt_arabic = Template(
    "\n".join([
        "بناءً على الوثائق المذكورة أعلاه فقط، يرجى توليد إجابة لسؤال المستخدم.",
        "## السؤال:",
        "$query",
        "",
        "### الإجابة:",
    ])
)